Repository: Twinlife/twinme-ios
Catalog: Twinme/InfoPlist.xcstrings
Source language: en
Languages: ar, da, de, es, fa, fi, fr, he, hi, id, it, ja, ko, nb, nl, pl, pt_pt, ru, sv, tr, uk, zh_hans, zh_hant

# NSAppleMusicUsageDescription
source: for connect your apple music
ar: لتوصيل موسيقى Apple الخاصة بك
da: at streame musik
de: um Musik zu streamen
es: para conectar tu música de Apple
fa: برای اتصال به موسیقی Apple خود
fi: Musiikin suoratoisto
fr: pour connecter avec apple music
he: כדי להתחבר למוזיקת התפוחים שלך
hi: अपने apple संगीत को जोड़ने के लिए
id: untuk menghubungkan musik apple Anda
it: per connettere la tua musica Apple
ja: Apple Music を接続するため
ko: 애플 뮤직 연결용
nb: å streame musikk
nl: Voor het streamen van muziek
pl: do podłączenia muzyki Apple
pt_pt: para ligar à sua música da Apple
ru: для подключения к Apple Music
sv: för att streama musik
tr: Apple müziğe bağlanmak
uk: для підключення вашої Apple Music
zh_hans: 用于连接您的苹果音乐
zh_hant: 流式傳輸音樂

# NSCameraUsageDescription
source: to take pictures and make video calls
ar: لالتقاط الصور وإجراء مكالمات الفيديو
da: at tage billeder og foretage videoopkald
de: um Videos aufzunehmen und Videoanrufe zu tätigen
es: para tomar fotos y realizar videollamadas
fa: برای گرفتن تصاویر و برقراری تماسهای تصویری
fi: kuvien ottamiseen ja videopuheluiden soittamiseen
fr: pour prendre des photos et faire des appels vidéos
he: לצלם ולבצע שיחות וידאו
hi: तस्वीरें लेने और वीडियो कॉल करने के लिए
id: untuk mengambil gambar dan melakukan panggilan video
it: per scattare foto ed effettuare videochiamate
ja: 写真を撮ったり、ビデオ通話をしたりします
ko: 사진 촬영 및 영상 통화용
nb: å ta bilder og ha videosamtaler
nl: Voor het schieten van foto’s en maken van video-oproepen
pl: do robienia zdjęć i prowadzenia rozmów wideo
pt_pt: para tirar fotos e fazer chamadas de vídeo
ru: чтобы делать снимки и совершать видеозвонки
sv: att ta bilder och göra videosamtal
tr: fotoğraf çekmek ve görüntülü arama yapmak
uk: фотографувати та здійснювати відеодзвінки
zh_hans: 拍照和进行视频通话
zh_hant: 拍照和進行視頻呼叫

# NSContactsUsageDescription
source: We need to access your contact list to be able to invite people to join you.
ar: نحتاج إلى الوصول إلى قائمة جهات الاتصال حتى نتمكن من دعوة الأشخاص للانضمام إليك.
da: Vi skal have adgang til din kontaktliste for at kunne invitere folk til at slutte sig til dig.
de: Wir müssen auf Ihre Kontaktliste zugreifen, um Personen zu Ihnen einladen zu können.
es: Necesitamos acceder a tu lista de contactos para poder invitar a la gente a que se una a ti.
fa: ما باید به لیست مخاطبین شما دسترسی داشته باشیم تا بتوانیم افراد را برای پیوستن به شما دعوت کنیم.
fi: Meidän on käytettävä yhteystietoluetteloasi voidaksemme kutsua ihmisiä liittymään sinuun.
fr: Nous avons besoin d'avoir accès à votre liste de contact pour vous permettre d'inviter des personnes à se connecter avec vous.
he: עלינו לגשת לרשימת אנשי הקשר שלך כדי שנוכל להזמין אנשים להצטרף אליך.
hi: हमें आपकी संपर्क सूची तक पहुंचने की आवश्यकता है ताकि लोगों को आपसे जुड़ने के लिए आमंत्रित किया जा सके.
id: Kami harus mengakses daftar kontak agar dapat mengundang orang lain untuk bergabung dengan Anda.
it: Dobbiamo accedere al tuo elenco di contatti per poter invitare le persone a unirsi a te.
ja: 人々を招待できるようにするには、連絡先リストにアクセスする必要があります。
ko: 사람을 초대하려면 연락처 목록에 액세스해야 합니다.
nb: Vi må ha tilgang til kontaktlisten din for å kunne invitere folk til å bli med deg.
nl: Vi skal have adgang til din kontaktliste for at kunne invitere folk til at slutte sig til dig.
pl: Musimy mieć dostęp do Twojej listy kontaktów, aby móc zapraszać innych do dołączenia do Ciebie.
pt_pt: Precisamos de aceder à sua lista de contactos para poder convidar pessoas para o acompanhar.
ru: Нам необходим доступ к списку контактов, чтобы иметь возможность приглашать людей присоединиться к вам.
sv: Vi måste komma åt din kontaktlista för att kunna bjuda in personer att gå med dig.
tr: Size katılmaları için birilerini davet edebilmek adına kişi listenize erişmeliyiz.
uk: Нам потрібен доступ до вашого списку контактів, щоб мати можливість запросити людей приєднатися до вас.
zh_hans: 我们需要访问您的联系人列表，以便能够邀请其他人加入您。
zh_hant: 我們需要訪問您的聯繫人列表才能邀請其他人加入您的行列。

# NSFaceIDUsageDescription
source: to authenticate and unlock access to the application
ar: للمصادقة وفتح الوصول إلى التطبيق
da: for at godkende og låse op for applikationen
de: um den Zugriff auf die Anwendung zu authentifizieren und zu entsperren
es: para autenticar y desbloquear el acceso a la aplicación
fa: برای تأیید اعتبار و باز کردن قفل دسترسی به برنامه
fi: todentamaan ja avaamaan sovelluksen käyttöoikeuden
fr: pour s’authentifier et déverrouiller l’accès à l’application
he: כדי לאמת ולפתוח את הגישה ליישום
hi: प्रमाणित और आवेदन के लिए उपयोग अनलॉक
id: untuk mengautentikasi dan membuka kunci akses ke aplikasi
it: per autenticare e sbloccare l’accesso all’applicazione
ja: アプリケーションへのアクセスを認証およびロック解除する
ko: 애플리케이션에 대한 액세스 인증 및 잠금 해제
nb: for å autentisere og låse opp tilgang til applikasjonen
nl: om de toegang tot de applicatie te verifiëren en te ontgrendelen
pl: do uwierzytelniania i odblokowywania dostępu do aplikacji
pt_pt: para autenticar e desbloquear o acesso ao aplicativo
ru: для аутентификации и разблокировки доступа к приложению
sv: för att autentisera och låsa upp åtkomst till applikationen
tr: uygulamaya erişimin kimliğini doğrulamak ve kilidini açmak için
uk: для автентифікації та розблокування доступу до програми
zh_hans: 验证和解锁对应用程序的访问
zh_hant: 驗證和解鎖對應用程序的訪問

# NSLocationAlwaysAndWhenInUseUsage
source: to share your location in real-time during a call
ar: لمشاركة موقعك في الوقت الفعلي أثناء المكالمة
da: at dele din placering i realtid under et opkald
de: um Ihren Standort während eines Anrufs in Echtzeit zu teilen
es: para compartir su ubicación en tiempo real durante una llamada
fa: برای به اشتراک گذاشتن موقعیت مکانی خود در زمان واقعی در طول یک تماس
fi: jakaa sijaintisi reaaliajassa puhelun aikana
fr: pour partager votre emplacement en temps-réel lors d'un appel
he: כדי לשתף את המיקום שלך בזמן אמת במהלך שיחה
hi: कॉल के दौरान वास्तविक समय में अपना स्थान साझा करने के लिए
id: untuk membagikan lokasi Anda secara real-time selama panggilan
it: per condividere la tua posizione in tempo reale durante una chiamata
ja: 通話中にリアルタイムで位置情報を共有する
ko: 통화 중에 실시간으로 위치를 공유하려면
nb: for å dele posisjonen din i sanntid under en samtale
nl: om uw locatie in realtime te delen tijdens een gesprek
pl: aby udostępniać swoją lokalizację w czasie rzeczywistym podczas rozmowy
pt_pt: para partilhar a sua localização em tempo real durante uma chamada
ru: чтобы поделиться своим местоположением в режиме реального времени во время разговора
sv: för att dela din plats i realtid under ett samtal
tr: Bir çağrı sırasında konumunuzu gerçek zamanlı olarak paylaşmak için
uk: щоб поділитися своїм місцезнаходженням у режимі реального часу під час виклику
zh_hans: 在通话期间实时分享您的位置
zh_hant: 在通話過程中即時分享您的位置

# NSLocationAlwaysAndWhenInUseUsageDescription
source: to share your location in real-time during a call
ar: لمشاركة موقعك في الوقت الفعلي أثناء المكالمة.
da: for at dele din placering i realtid under et opkald.
de: Um Ihren Standort in Echtzeit während eines Anrufs zu teilen.
es: para compartir tu ubicación en tiempo real durante una llamada.
fa: برای به اشتراک گذاشتن موقعیت مکانی واقعی خود در طول تماس.
fi: om uw realtimelocatie te delen tijdens een gesprek.
fr: pour partager votre position en temps réel pendant un appel.
he: כדי לשתף את מיקומך בזמן אמת במהלך שיחה.
hi: कॉल के दौरान अपना वास्तविक समय स्थान साझा करने के लिए।
id: untuk membagikan lokasi Anda saat ini selama panggilan.
it: per condividere la tua posizione in tempo reale durante una chiamata.
ja: 通話中にリアルタイムの位置情報を共有します。
ko: 통화 중에 실시간 위치를 공유합니다.
nb: for å dele din sanntidsposisjon under en samtale.
nl: om uw realtimelocatie te delen tijdens een gesprek.
pl: aby udostępnić swoją lokalizację w czasie rzeczywistym podczas rozmowy.
pt_pt: Para partilhar a sua localização em tempo real durante uma chamada.
ru: чтобы делиться своим местонахождением в реальном времени во время звонка.
sv: för att dela din realtidsposition under ett samtal.
tr: Bir arama sırasında gerçek zamanlı konumunuzu paylaşmak için.
uk: щоб ділитися своїм місцезнаходженням у реальному часі під час дзвінка.
zh_hans: 在通话过程中共享您的实时位置。
zh_hant: 在通話過程中分享您的即時位置。

# NSLocationWhenInUseUsageDescription
source: to share your location in a conversation
ar: لمشاركة موقعك في المحادثة
da: for at dele din placering i en samtale
de: um Ihren Standort in einer Unterhaltung zu teilen
es: para compartir tu ubicación en una conversación
fa: برای به اشتراک گذاشتن موقعیت مکانی خود در یک مکالمه
fi: jakaaksesi sijaintisi keskustelussa
fr: pour partager votre emplacement dans une conversation
he: כדי לשתף את המיקום שלך בשיחה
hi: बातचीत में अपना स्थान साझा करने के लिए
id: untuk membagikan lokasi Anda dalam percakapan
it: per condividere la tua posizione in una conversazione
ja: 会話中に位置情報を共有する
ko: 대화에서 위치를 공유하려면
nb: for å dele posisjonen din i en samtale
nl: om uw locatie in een gesprek te delen
pl: aby udostępnić swoją lokalizację w rozmowie
pt_pt: para partilhar a sua localização numa conversa
ru: чтобы поделиться своим местоположением в разговоре
sv: för att dela din plats i en konversation
tr: bir görüşmede konumunuzu paylaşmak için
uk: щоб поділитися своїм місцезнаходженням у розмові
zh_hans: 在对话中分享您的位置
zh_hant: 在對話中分享您的位置

# NSMicrophoneUsageDescription
source: to make audio and video calls
ar: لإجراء مكالمات الصوت والفيديو
da: at foretage stemme- og videoopkald
de: für Profilbilder und um Chat-Nachrichten zu senden
es: para realizar llamadas de audio y videollamadas
fa: برای برقراری تماس صوتی و تصویری
fi: ääni- ja videopuheluiden soittamiseen
fr: pour les appels audio et vidéo
he: לביצוע שיחות שמע ווידאו
hi: ऑडियो और वीडियो कॉल करने के लिए
id: untuk melakukan panggilan audio dan video
it: per effettuare chiamate audio e video
ja: 音声通話とビデオ通話を行う
ko: 음성 및 영상 통화용
nb: å ha tale- og videosamtaler
nl: Voor het maken van telefonische en video-oproepen
pl: do wykonywania połączeń audio i wideo
pt_pt: para fazer chamadas de áudio e vídeo
ru: совершать голосовые и видеозвонки
sv: att göra röst- och videosamtal
tr: sesli ve görüntülü arama yapmak
uk: для здійснення аудіо та відеодзвінків
zh_hans: 进行音频和视频呼叫
zh_hant: 進行語音和視頻呼叫

# NSPhotoLibraryAddUsageDescription
source: To save photos and videos exchanged in conversations, as well as invitation QR-codes, to the device's photo album.
ar: لحفظ الصور ومقاطع الفيديو من المحادثات، وكذلك رموز QR الخاصة بالدعوة، في ألبوم الصور الخاص بالجهاز.
da: For at gemme billeder og videoer fra samtaler, samt invitations-QR-koder, til enhedens fotoalbum.
de: Zum Speichern von Fotos und Videos aus Unterhaltungen sowie Einladungs-QR-Codes im Fotoalbum des Geräts.
es: Para guardar las fotos y los vídeos de las conversaciones, así como los códigos QR de invitación, en el álbum de fotos del dispositivo.
fa: برای ذخیره عکس ها و ویدیوهای رد و بدل شده در مکالمات، و همچنین کدهای QR دعوت، در آلبوم عکس دستگاه.
fi: Voit tallentaa keskusteluissa vaihdetut kuvat ja videot sekä kutsujen QR-koodit laitteen valokuva-albumiin.
fr: Pour enregistrer des photos et vidéos échangées dans les conversations, ainsi que les QR-codes d'invitation, dans l'album photo de l'appareil.
he: כדי לשמור תמונות וסרטונים שהוחלפו בשיחות, כמו גם קודי QR להזמנה, באלבום התמונות של המכשיר.
hi: बातचीत में आदान-प्रदान की गई फ़ोटो और वीडियो, साथ ही आमंत्रण क्यूआर-कोड को डिवाइस के फ़ोटो एल्बम में सहेजने के लिए।
id: Untuk menyimpan foto dan video dari percakapan, serta kode QR undangan, ke album foto perangkat.
it: Per salvare foto e video dalle conversazioni, nonché codici QR di invito, nell'album fotografico del dispositivo.
ja: 会話で交換された写真やビデオ、および招待用 QR コードをデバイスのフォト アルバムに保存します。
ko: 대화에서 교환된 사진과 비디오, 초대 QR 코드를 기기의 사진 앨범에 저장합니다.
nb: For å lagre bilder og videoer utvekslet i samtaler, samt invitasjons-QR-koder, til enhetens fotoalbum.
nl: Om foto's en video's van gesprekken, evenals QR-codes voor uitnodigingen, op te slaan in het fotoalbum van het apparaat.
pl: Aby zapisać zdjęcia i filmy z konwersacji, a także kody QR zaproszeń, do albumu zdjęć urządzenia.
pt_pt: Para guardar fotografias e vídeos trocados em conversas, bem como QR-codes de convite, no álbum de fotografias do dispositivo.
ru: Сохранять фотографии и видео из бесед, а также QR-коды приглашений, в фотоальбоме устройства.
sv: För att spara foton och videor från konversationer, samt QR-koder för inbjudningar, till enhetens fotoalbum.
tr: Konuşmalarda paylaşılan fotoğraf ve videoları, davet QR kodlarını cihazın fotoğraf albümüne kaydetmek.
uk: Для збереження фотографій і відео, якими обмінювалися в розмовах, а також QR-кодів запрошень у фотоальбом пристрою.
zh_hans: 将对话中交换的照片和视频以及邀请二维码保存到设备相册。
zh_hant: 將對話中交換的照片和視頻以及邀請二維碼保存到設備相冊。

# NSPhotoLibraryUsageDescription
source: for profile images and to send in chat messages
ar: لصور الصفحة الشخصية وإرسال رسائل الدردشة
da: til profilbilleder og at sende chatbeskeder
de: um Ihren Twincode in Fotos zu speichern
es: para imágenes de perfil y enviar mensajes de chat
fa: برای تصاویر پروفایل و برای ارسال پیام​های چت
fi: profiilin kuviin ja pikaviestien lähettämiseen
fr: pour les images de profils et envoyer des messages images sur le chat
he: לתמונות פרופיל ולשליחת שיחות צ'אט
hi: प्रोफ़ाइल छवियों के लिए और चैट संदेशों में भेजने के लिए
id: untuk gambar profil dan untuk mengirim pesan obrolan
it: per le immagini del profilo e per inviare messaggi di chat
ja: プロフィール画像とチャットメッセージの送信のため
ko: 프로필 이미지와 채팅 메시지 전송용
nb: for profilbilder og for å sende inn chat-meldinger
nl: Voor profielafbeeldingen en het verzenden van chatberichten
pl: do zdjęć profilowych i do wysyłania wiadomości na czacie
pt_pt: para imagens de perfil e enviar mensagens de chat
ru: для изображения профиля и отправки сообщений чата
sv: för profilbilder och skicka chattmeddelanden
tr: profil resimleri ve sohbetlerde göndermek
uk: для зображень профілю та надсилання в повідомленнях чату
zh_hans: 用于个人资料图片和聊天消息发送
zh_hant: 個人資料圖像和聊天信息發送
